---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussFamilyVertWebStructuralTypesParam
source: html/e97f6dfd-a90f-04e3-cdd9-483ea1b712ce.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussFamilyVertWebStructuralTypesParam Property

"Structural Framing Type"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussFamilyVertWebStructuralTypesParam { get; }
```